In [12]:
import pandas as pd
import numpy as np

In [13]:
df1 = pd.DataFrame( {'ID': range(1,21),
                     'Category': np.random.choice(['A', 'A+', 'B', 'C'], size=20)} )

In [14]:
df1

    ID Category
0    1        C
1    2        B
2    3        B
3    4       A+
4    5        C
5    6        B
6    7        A
7    8        C
8    9       A+
9   10       A+
10  11        A
11  12        A
12  13        B
13  14        C
14  15       A+
15  16        A
16  17        B
17  18       A+
18  19        C
19  20        B

In [15]:
df1['Score'] = np.select([df1.Category == 'A+', df1.Category == 'A', df1.Category == 'B', df1.Category == 'C'],
                        [10, np.random.choice([7,8,9]), np.random.choice([4,5,6]), np.random.choice([1,2,3])])

In [16]:
df1

    ID Category  Score
0    1        C      2
1    2        B      6
2    3        B      6
3    4       A+     10
4    5        C      2
5    6        B      6
6    7        A      8
7    8        C      2
8    9       A+     10
9   10       A+     10
10  11        A      8
11  12        A      8
12  13        B      6
13  14        C      2
14  15       A+     10
15  16        A      8
16  17        B      6
17  18       A+     10
18  19        C      2
19  20        B      6

In [18]:
df2 = pd.DataFrame( { 'ID': range(1,21),
                     'Category': df1.Category} )
df2['Location'] = np.select([df1.Category == 'A+', df1.Category == 'A', df1.Category == 'B', df1.Category == 'C'],
                            ['North', np.random.choice(['Southwest','South']), np.random.choice(['South', 'East', 'Northeast']), np.random.choice(['Northeast','South','Southeast'])])

In [19]:
df2

    ID Category   Location
0    1        C      South
1    2        B       East
2    3        B       East
3    4       A+      North
4    5        C      South
5    6        B       East
6    7        A  Southwest
7    8        C      South
8    9       A+      North
9   10       A+      North
10  11        A  Southwest
11  12        A  Southwest
12  13        B       East
13  14        C      South
14  15       A+      North
15  16        A  Southwest
16  17        B       East
17  18       A+      North
18  19        C      South
19  20        B       East

In [20]:
# MERGE on the column ID
df1.merge(df2, on='ID', how= 'inner')

    ID Category_x  Score Category_y   Location
0    1          C      2          C      South
1    2          B      6          B       East
2    3          B      6          B       East
3    4         A+     10         A+      North
4    5          C      2          C      South
5    6          B      6          B       East
6    7          A      8          A  Southwest
7    8          C      2          C      South
8    9         A+     10         A+      North
9   10         A+     10         A+      North
10  11          A      8          A  Southwest
11  12          A      8          A  Southwest
12  13          B      6          B       East
13  14          C      2          C      South
14  15         A+     10         A+      North
15  16          A      8          A  Southwest
16  17          B      6          B       East
17  18         A+     10         A+      North
18  19          C      2          C      South
19  20          B      6          B       East

In [22]:
#

In [29]:
# case-1

In [24]:
import pandas as pd

roll_no = [501, 502, 503, 504, 505]

student_df = pd.DataFrame({
    'Name': ["Jennifer", "Travis", "Bob", "Emma", "Luna", "Anish"],
    'Gender':  ["Female", "Male", "Male", "Female", "Female", "Male"],
    'Age': [17, 18, 17, 16, 18, 16]
})

grades_df = pd.DataFrame({
    "Roll No": [501, 502, 503, 504, 505, 506],
    "Grades": ["A", "B+", "A-", "A", "B", "A+"]
}
)

In [25]:
student_df

       Name  Gender  Age
0  Jennifer  Female   17
1    Travis    Male   18
2       Bob    Male   17
3      Emma  Female   16
4      Luna  Female   18
5     Anish    Male   16

In [26]:
grades_df

   Roll No Grades
0      501      A
1      502     B+
2      503     A-
3      504      A
4      505      B
5      506     A+

In [27]:
joined_df = student_df.join(grades_df)
joined_df

       Name  Gender  Age  Roll No Grades
0  Jennifer  Female   17      501      A
1    Travis    Male   18      502     B+
2       Bob    Male   17      503     A-
3      Emma  Female   16      504      A
4      Luna  Female   18      505      B
5     Anish    Male   16      506     A+

It joins the student_df and grades_df, and creates joined_df. By default, the join() method uses the index of both DataFrames to join them. The join method is Left Join by default. Here, all the rows of left DataFrame i.e student_df are kept in the joined_df, and a row with right DataFrame having the same value of the index as of row in left DataFrame are joined and placed in the same row.

In [28]:
# case-2

In [30]:
roll_no = [501, 502, 503, 504, 505]

student_df = pd.DataFrame({
    "Roll No": [501, 502, 503, 504, 505, 506],
    'Name': ["Jennifer", "Travis", "Bob", "Emma", "Luna", "Anish"],
    'Gender':  ["Female", "Male", "Male", "Female", "Female", "Male"],
    'Age': [17, 18, 17, 16, 18, 16]
})

In [31]:
student_df

   Roll No      Name  Gender  Age
0      501  Jennifer  Female   17
1      502    Travis    Male   18
2      503       Bob    Male   17
3      504      Emma  Female   16
4      505      Luna  Female   18
5      506     Anish    Male   16

In [33]:
grades_df = pd.DataFrame({
    "Roll No": [501, 502, 503, 504, 505, 506],
    "Grades": ["A", "B+", "A-", "A", "B", "A+"]
}
)

grades_df

   Roll No Grades
0      501      A
1      502     B+
2      503     A-
3      504      A
4      505      B
5      506     A+

In [34]:
joined_df = student_df.join(grades_df, lsuffix="_left", rsuffix="_right")

In [35]:
joined_df

   Roll No_left      Name  Gender  Age  Roll No_right Grades
0           501  Jennifer  Female   17            501      A
1           502    Travis    Male   18            502     B+
2           503       Bob    Male   17            503     A-
3           504      Emma  Female   16            504      A
4           505      Luna  Female   18            505      B
5           506     Anish    Male   16            506     A+

It joins grades_df at the right of the student_df. The DataFrame.join() does not merge the individual DataFrames i.e. even if the Roll No column is common to both the DataFrames, they will be placed as separate fields after join(). To distinguish the column name with a common name, we provide suffix for both columns in the left and right DataFrame using the lsuffix and rsuffix parameters.

Alternatively, we can also DataFrame.merge() method to solve the issue by passing the common columnâ€™s name as an on parameter into the method.

In [36]:
# case-3

In [37]:
roll_no = [501, 502, 503, 504, 505]

student_df = pd.DataFrame({
    "Roll No": [501, 502, 503, 504, 505, 506],
    'Name': ["Jennifer", "Travis", "Bob", "Emma", "Luna", "Anish"],
    'Gender':  ["Female", "Male", "Male", "Female", "Female", "Male"],
    'Age': [17, 18, 17, 16, 18, 16]
})


student_df

   Roll No      Name  Gender  Age
0      501  Jennifer  Female   17
1      502    Travis    Male   18
2      503       Bob    Male   17
3      504      Emma  Female   16
4      505      Luna  Female   18
5      506     Anish    Male   16

In [38]:
grades_df = pd.DataFrame({
    "Roll No": [501, 502, 503, 504, 505, 506],
    "Grades": ["A", "B+", "A-", "A", "B", "A+"]
}
)
grades_df

   Roll No Grades
0      501      A
1      502     B+
2      503     A-
3      504      A
4      505      B
5      506     A+

In [39]:
merged_df = student_df.merge(grades_df, on="Roll No")

In [40]:
merged_df

   Roll No      Name  Gender  Age Grades
0      501  Jennifer  Female   17      A
1      502    Travis    Male   18     B+
2      503       Bob    Male   17     A-
3      504      Emma  Female   16      A
4      505      Luna  Female   18      B
5      506     Anish    Male   16     A+

In [41]:
#

In [42]:
dataFrame1 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Audi', 'Mustang', 'Bentley', 'Jaguar'],
      "Units": [100, 150, 110, 80, 110, 90]
   }
)

In [43]:
dataFrame1

       Car  Units
0      BMW    100
1    Lexus    150
2     Audi    110
3  Mustang     80
4  Bentley    110
5   Jaguar     90

In [47]:
dataFrame2 = pd.DataFrame(
   {
      "Car": ['BMW', 'Lexus', 'Tesla', 'Mustang', 'Mercedes', 'Jaguar'],
      "Reg_Price": [7000, 1500, 5000, 8000, 9000, 6000]})

In [48]:
dataFrame2

        Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

In [49]:
mergedRes = pd.merge(dataFrame1, dataFrame2, on ='Car', how ="inner")
mergedRes

       Car  Units  Reg_Price
0      BMW    100       7000
1    Lexus    150       1500
2  Mustang     80       8000
3   Jaguar     90       6000

In [50]:
dataFrame1

       Car  Units
0      BMW    100
1    Lexus    150
2     Audi    110
3  Mustang     80
4  Bentley    110
5   Jaguar     90

In [51]:
dataFrame2

        Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

In [52]:
mergedRes2 = pd.merge(dataFrame1, dataFrame2, on ='Car', how ="left")
mergedRes2

       Car  Units  Reg_Price
0      BMW    100     7000.0
1    Lexus    150     1500.0
2     Audi    110        NaN
3  Mustang     80     8000.0
4  Bentley    110        NaN
5   Jaguar     90     6000.0

In [53]:
dataFrame1

       Car  Units
0      BMW    100
1    Lexus    150
2     Audi    110
3  Mustang     80
4  Bentley    110
5   Jaguar     90

In [54]:
dataFrame2

        Car  Reg_Price
0       BMW       7000
1     Lexus       1500
2     Tesla       5000
3   Mustang       8000
4  Mercedes       9000
5    Jaguar       6000

In [55]:
mergedRes3 = pd.merge(dataFrame1, dataFrame2, on ='Car', how ="right")
mergedRes3

        Car  Units  Reg_Price
0       BMW  100.0       7000
1     Lexus  150.0       1500
2   Mustang   80.0       8000
3    Jaguar   90.0       6000
4     Tesla    NaN       5000
5  Mercedes    NaN       9000

In [56]:
# from documentation

In [57]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})

In [58]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [59]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [60]:
# Merge df1 and df2 on the lkey and rkey columns. The value columns have the default suffixes, _x and _y, appended.
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [61]:
#Merge DataFrames df1 and df2 with specified left and right suffixes appended to any overlapping columns.

df1.merge(df2, left_on='lkey', right_on='rkey',
           suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [62]:
# concat

In [63]:
import pandas as pd

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'B': ['B2', 'B3', 'B4', 'B5'],
                    'D': ['D2', 'D3', 'D4', 'D5'],
                    'F': ['F2', 'F3', 'F4', 'F5']},
                   index=[2, 3, 4, 5])

In [64]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [65]:
df2

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
4  B4  D4  F4
5  B5  D5  F5

In [66]:
# Join

In [72]:
d1 = {'Id': ['A1', 'A2', 'A3', 'A4','A'],
 'Name':['Vivek', 'Rahul', 'Gaurav', 'Ankit','Vishakha'], 
 'Age':[27, 24, 22, 32, 28],} 
 
 
d2 = {'Id': ['A1', 'A2', 'A3', 'A4'],
 'Address':['Delhi', 'Gurgaon', 'Noida', 'Pune'], 
 'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

In [75]:
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [76]:
df1

   Id      Name  Age
0  A1     Vivek   27
1  A2     Rahul   24
2  A3    Gaurav   22
3  A4     Ankit   32
4   A  Vishakha   28

In [77]:
df2

   Id  Address Qualification
0  A1    Delhi         Btech
1  A2  Gurgaon           B.A
2  A3    Noida          Bcom
3  A4     Pune        B.hons

In [78]:
#Inner Join
pd.merge(df1,df2)
#simple merge with no additional arguments performs an inner/equi join equivalent to data base join operation

   Id    Name  Age  Address Qualification
0  A1   Vivek   27    Delhi         Btech
1  A2   Rahul   24  Gurgaon           B.A
2  A3  Gaurav   22    Noida          Bcom
3  A4   Ankit   32     Pune        B.hons

In [79]:
df1

   Id      Name  Age
0  A1     Vivek   27
1  A2     Rahul   24
2  A3    Gaurav   22
3  A4     Ankit   32
4   A  Vishakha   28

In [80]:
df2

   Id  Address Qualification
0  A1    Delhi         Btech
1  A2  Gurgaon           B.A
2  A3    Noida          Bcom
3  A4     Pune        B.hons

In [83]:
#Left Join

pd.merge(df1,df2,how='left')

   Id      Name  Age  Address Qualification
0  A1     Vivek   27    Delhi         Btech
1  A2     Rahul   24  Gurgaon           B.A
2  A3    Gaurav   22    Noida          Bcom
3  A4     Ankit   32     Pune        B.hons
4   A  Vishakha   28      NaN           NaN

In [84]:
df1

   Id      Name  Age
0  A1     Vivek   27
1  A2     Rahul   24
2  A3    Gaurav   22
3  A4     Ankit   32
4   A  Vishakha   28

In [85]:
df2

   Id  Address Qualification
0  A1    Delhi         Btech
1  A2  Gurgaon           B.A
2  A3    Noida          Bcom
3  A4     Pune        B.hons

In [86]:
#Right Join
pd.merge(df1,df2,how='right')

   Id    Name  Age  Address Qualification
0  A1   Vivek   27    Delhi         Btech
1  A2   Rahul   24  Gurgaon           B.A
2  A3  Gaurav   22    Noida          Bcom
3  A4   Ankit   32     Pune        B.hons

In [88]:
#outer join
pd.merge(df1,df2,how='outer')

   Id      Name  Age  Address Qualification
0  A1     Vivek   27    Delhi         Btech
1  A2     Rahul   24  Gurgaon           B.A
2  A3    Gaurav   22    Noida          Bcom
3  A4     Ankit   32     Pune        B.hons
4   A  Vishakha   28      NaN           NaN

In [90]:
d1 = {'Id': ['A1', 'A2', 'A3', 'A4','A'],
 'Name':['Vivek', 'Rahul', 'Gaurav', 'Ankit','Vishakha'], 
 'Age':[27, 24, 22, 32, 28],} 
 
 
d2 = {'ID': ['A1', 'A2', 'A3', 'A4'],
 'Address':['Delhi', 'Gurgaon', 'Noida', 'Pune'], 
 'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}
df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [91]:
df1

   Id      Name  Age
0  A1     Vivek   27
1  A2     Rahul   24
2  A3    Gaurav   22
3  A4     Ankit   32
4   A  Vishakha   28

In [93]:
df2 # here the merging keys are different

   ID  Address Qualification
0  A1    Delhi         Btech
1  A2  Gurgaon           B.A
2  A3    Noida          Bcom
3  A4     Pune        B.hons

In [95]:
#lets check when merging keys are different ('Id' and 'ID')
#pd.merge(df1,df2) # will generate error
# #df1 key column 'Id'
#df2 key column 'ID'

In [96]:
# join

In [97]:
import pandas as pd
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K5', 'K3', 'K4', 'K2'],
 'A': ['A0', 'A1', 'A5', 'A3', 'A4', 'A2']})
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
 'B': ['B0', 'B1', 'B2']})

In [98]:
df1

  key   A
0  K0  A0
1  K1  A1
2  K5  A5
3  K3  A3
4  K4  A4
5  K2  A2

In [99]:
df2

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [100]:
# Case 1. join on indexes

In [102]:
#default nature of pandas join is left outer join
df1.join(df2, lsuffix='_l', rsuffix='_r')

  key_l   A key_r    B
0    K0  A0    K0   B0
1    K1  A1    K1   B1
2    K5  A5    K2   B2
3    K3  A3   NaN  NaN
4    K4  A4   NaN  NaN
5    K2  A2   NaN  NaN

In [103]:
# join on different index values

In [104]:
df1 = pd.DataFrame({'key': ['K0', 'K1', 'K5', 'K3', 'K4', 'K2'],
 'A': ['A0', 'A1', 'A5', 'A3', 'A4', 'A2']},index=[0,1,2,3,4,5])
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
 'B': ['B0', 'B1', 'B2']},index=[6,7,8])

In [105]:
df1

  key   A
0  K0  A0
1  K1  A1
2  K5  A5
3  K3  A3
4  K4  A4
5  K2  A2

In [106]:
df2

  key   B
6  K0  B0
7  K1  B1
8  K2  B2

In [108]:
df1.join(df2,lsuffix='_l',rsuffix='_r')

  key_l   A key_r    B
0    K0  A0   NaN  NaN
1    K1  A1   NaN  NaN
2    K5  A5   NaN  NaN
3    K3  A3   NaN  NaN
4    K4  A4   NaN  NaN
5    K2  A2   NaN  NaN

In [109]:
df1

  key   A
0  K0  A0
1  K1  A1
2  K5  A5
3  K3  A3
4  K4  A4
5  K2  A2

In [110]:
df2

  key   B
6  K0  B0
7  K1  B1
8  K2  B2

In [112]:
#inner join
df1.join(df2,lsuffix='_l',rsuffix='_r',how='inner')

Empty DataFrame
Columns: [key_l, A, key_r, B]
Index: []

In [115]:
df1.set_index('key').join(df2.set_index('key'))

      A    B
key
K0   A0   B0
K1   A1   B1
K5   A5  NaN
K3   A3  NaN
K4   A4  NaN
K2   A2   B2